---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MassDataGlazingIsShaded
source: html/c4582bb4-7884-9b0f-e6bd-ccbc56be10a1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MassDataGlazingIsShaded Property

"Glazing is Shaded"

## Syntax (C#)
```csharp
public static ForgeTypeId MassDataGlazingIsShaded { get; }
```